package base.operator;

public class Demo06 {
    public static void main(String[] args) {
        //二进制转十进制
        //0b1011 = 1*2的0次方+1*2的1次方+1*2的2次方 = 7
        //八进制转十进制
        //024 = 4*8的0次方+2*8的1次方 = 20
        //十六进制转十进制

        //十进制转二进制
        //34除2重复取余数
        //34 = 0b100010
        //十进制转八进制
        //十进制转十六进制

        //二进制转八进制
        //0b11010101 = (11)(010)(101)= 325
        //二进制转十六进制
        //0b11010101 = (1101)(0101) = 0xD5

        //八进制转二进制
        //02(010)3(011)7(111) = 0b010011111
        //十六进制转二进制
        //0x2(0010)3(0011)B(1011) = 0b00100111011


}
}


